In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1 = {"Isim": ["ahmet", "mehmet", "zeynep", "atil"],
           "Spor" : ["Kosu", "Yuzme", "Kosu", "basket"],
           "Kalori" : [100,200,300,400] }

In [4]:
dataframe1 = pd.DataFrame(sozluk1, index = [0,1,2,3])

In [5]:
dataframe1

     Isim    Spor  Kalori
0   ahmet    Kosu     100
1  mehmet   Yuzme     200
2  zeynep    Kosu     300
3    atil  basket     400

In [14]:
sozluk2 = {"Isim": ["osman", "levent", "atlas", "fatma"],
           "Spor" : ["Kosu", "Yuzme", "Kosu", "basket"],
           "Kalori" : [200,300,400,100] }

In [15]:
dataframe2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [16]:
dataframe2

     Isim    Spor  Kalori
4   osman    Kosu     200
5  levent   Yuzme     300
6   atlas    Kosu     400
7   fatma  basket     100

In [17]:
sozluk3 = {"Isim": ["ayse", "mahmut", "duygu", "nur"],
           "Spor" : ["Kosu", "Yuzme", "badminton", "tenis"],
           "Kalori" : [400,100,200,500] }

In [18]:
dataframe3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [19]:
dataframe3

      Isim       Spor  Kalori
8     ayse       Kosu     400
9   mahmut      Yuzme     100
10   duygu  badminton     200
11     nur      tenis     500

## concatenation

In [24]:
pd.concat([dataframe1,dataframe2,dataframe3], axis = 0)
# 3 farklı ama aynı kolon indexlerine sahip listeyi birleştirmemizi sağladı.
# axis = 0 yazmasak da olur. varsayılan olarak kolon bazlı listeliyor. Hatırlatma için ekledim.

      Isim       Spor  Kalori
0    ahmet       Kosu     100
1   mehmet      Yuzme     200
2   zeynep       Kosu     300
3     atil     basket     400
4    osman       Kosu     200
5   levent      Yuzme     300
6    atlas       Kosu     400
7    fatma     basket     100
8     ayse       Kosu     400
9   mahmut      Yuzme     100
10   duygu  badminton     200
11     nur      tenis     500